### UTF-8 ＠ぱすた＠ ###
#----------------------------------------------------------------------
### アーリオ：会話辞書管理 
管理単位：item
            name: トーク名
            talk: トーク本体
###
#----------------------------------------------------------------------
define ["engine/aglio_dic"], (dic) ->

#---# --------------------------------------------------------------
    ### 会話/イベント登録関数のショートカット ###
    dic::会話     = (arg...) -> @quantum("会話"    , arg...)
    dic::分岐     = (arg...) -> @quantum("分岐"    , arg...)
    dic::イベント = (arg...) -> @quantum("イベント", arg...)

#---# --------------------------------------------------------------
    ### entangle関数のショートカット ###
    dic::呼出     = (arg) -> @entangle("分岐 " + arg)

#---# --------------------------------------------------------------
    ### sentence関数のショートカット ###
    dic::パスタ１ = (arg) -> @sentence("pasta", "p1", arg)
    dic::パスタ２ = (arg) -> @sentence("pasta", "p2", arg)
    dic::ソルト１ = (arg) -> @sentence("salt" , "p1", arg)
    dic::ソルト２ = (arg) -> @sentence("salt" , "p2", arg)

#---# --------------------------------------------------------------
    ### 辞書インスタンスを返す ###
    dic